# Определить индексы элементов массива (списка), значения которых принадлежат заданному диапазону (т.е. не
# меньше заданного минимума и не больше заданного максимума)
# Ввод: [-5, 9, 0, 3, -1, -2, 1,
# 4, -2, 10, 2, 0, -9, 8, 10, -9,
# 0, -5, -5, 7]
# Вывод: [1, 9, 13, 14, 19]

from random import randint 
list = [randint (0, 50) for _ in range(randint(10, 15))]
print(list)

n1, n2 = map(int, input('Введите нижнее и верхнее значение диапазона через пробел ').split())

index_list = [i for i in range(len(list)) if n1 < list[i] < n2 ]
print (index_list)